import Button from "./UIelements/Button";
import styles from "./agreement.module.css";

function Agreement() {
  return (
    <>
      <h4 className="font-light text-[clamp(24px,2vw,32px)]">
        Ознакомьтесь с правилами
      </h4>
      <div
        className={`text-sm font-light text-start my-[30px] h-[508px] overflow-auto ${styles.scrollbar}`}
      >
        <p className="mb-[37px]">
          Настоящие Правила разработаны в соответствии с Законом Российской
          Федерации "О защите прав потребителей" и регулируют отношения между
          продавцами и потребителями при продаже товаров по договору розничной
          купли-продажи, в том числе отношения между продавцами и потребителями
          при дистанционном способе продажи товаров.
        </p>
        <p className="mb-[37px]">
          На торговых объектах (за исключением мест, которые определяются
          продавцом и не предназначены для свободного доступа потребителей) не
          допускается ограничение прав потребителей на поиск и получение любой
          информации в любых формах из любых источников, в том числе путем
          фотографирования товара, если такие действия не нарушают требования
          законодательства Российской Федерации и международных договоров
          Российской Федерации.
        </p>
        <p className="mb-[37px]">
          При продаже товаров потребителю предоставляется возможность
          самостоятельно или с помощью продавца ознакомиться с необходимыми
          товарами. Продавец обязан обеспечить наличие ценников на реализуемые
          товары с указанием наименования товара, цены за единицу товара или за
          единицу измерения товара (вес (масса нетто), длина и др.).
        </p>
        <p className="mb-[37px]">
          При продаже товаров потребителю предоставляется возможность
          самостоятельно или с помощью продавца ознакомиться с необходимыми
          товарами. Продавец обязан обеспечить наличие ценников на реализуемые
          товары с указанием наименования товара, цены за единицу товара или за
          единицу измерения товара (вес (масса нетто), длина и др.).
        </p>
        <p className="mb-[37px]">
          При продаже товаров потребителю предоставляется возможность
          самостоятельно или с помощью продавца ознакомиться с необходимыми
          товарами. Продавец обязан обеспечить наличие ценников на реализуемые
          товары с указанием наименования товара, цены за единицу товара или за
          единицу измерения товара (вес (масса нетто), длина и др.).
        </p>
        <p className="mb-[37px]">
          При продаже товаров потребителю предоставляется возможность
          самостоятельно или с помощью продавца ознакомиться с необходимыми
          товарами. Продавец обязан обеспечить наличие ценников на реализуемые
          товары с указанием наименования товара, цены за единицу товара или за
          единицу измерения товара (вес (масса нетто), длина и др.).
        </p>
        <p className="mb-[37px]">
          При продаже товаров потребителю предоставляется возможность
          самостоятельно или с помощью продавца ознакомиться с необходимыми
          товарами. Продавец обязан обеспечить наличие ценников на реализуемые
          товары с указанием наименования товара, цены за единицу товара или за
          единицу измерения товара (вес (масса нетто), длина и др.).
        </p>
        <p className="mb-[37px]">
          При продаже товаров потребителю предоставляется возможность
          самостоятельно или с помощью продавца ознакомиться с необходимыми
          товарами. Продавец обязан обеспечить наличие ценников на реализуемые
          товары с указанием наименования товара, цены за единицу товара или за
          единицу измерения товара (вес (масса нетто), длина и др.).
        </p>
        <p className="mb-[37px]">
          При продаже товаров потребителю предоставляется возможность
          самостоятельно или с помощью продавца ознакомиться с необходимыми
          товарами. Продавец обязан обеспечить наличие ценников на реализуемые
          товары с указанием наименования товара, цены за единицу товара или за
          единицу измерения товара (вес (масса нетто), длина и др.).
        </p>
        <p className="mb-[37px]">
          При продаже товаров потребителю предоставляется возможность
          самостоятельно или с помощью продавца ознакомиться с необходимыми
          товарами. Продавец обязан обеспечить наличие ценников на реализуемые
          товары с указанием наименования товара, цены за единицу товара или за
          единицу измерения товара (вес (масса нетто), длина и др.).
        </p>
        <p className="mb-[37px]">
          При продаже товаров потребителю предоставляется возможность
          самостоятельно или с помощью продавца ознакомиться с необходимыми
          товарами. Продавец обязан обеспечить наличие ценников на реализуемые
          товары с указанием наименования товара, цены за единицу товара или за
          единицу измерения товара (вес (масса нетто), длина и др.).
        </p>
        <p className="mb-[37px]">
          При продаже товаров потребителю предоставляется возможность
          самостоятельно или с помощью продавца ознакомиться с необходимыми
          товарами. Продавец обязан обеспечить наличие ценников на реализуемые
          товары с указанием наименования товара, цены за единицу товара или за
          единицу измерения товара (вес (масса нетто), длина и др.).
        </p>
        <p className="mb-[37px]">
          При продаже товаров потребителю предоставляется возможность
          самостоятельно или с помощью продавца ознакомиться с необходимыми
          товарами. Продавец обязан обеспечить наличие ценников на реализуемые
          товары с указанием наименования товара, цены за единицу товара или за
          единицу измерения товара (вес (масса нетто), длина и др.).
        </p>
        <p className="mb-[37px]">
          При продаже товаров потребителю предоставляется возможность
          самостоятельно или с помощью продавца ознакомиться с необходимыми
          товарами. Продавец обязан обеспечить наличие ценников на реализуемые
          товары с указанием наименования товара, цены за единицу товара или за
          единицу измерения товара (вес (масса нетто), длина и др.).
        </p>
        <p>
          При продаже продавцом товара, который может быть измерен, продавец
          обязан применять средства измерений, находящиеся в исправном состоянии
          и соответствующие требованиям законодательства Российской Федерации об
          обеспечении единства измерений.
        </p>
      </div>
      <Button>Согласен с правилами</Button>
    </>
  );
}

export default Agreement;
